/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isprint.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mnalyvai <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/02 17:30:47 by mnalyvai          #+#    #+#             */
/*   Updated: 2023/03/26 15:06:02 by mnalyvai         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/* isprint возвращает ненулевое значение если ch 
это печатаемый символ (0x20 - 0x7E) в противном случае возвращается 0. 
Значения печатных символов находятся в пределах от 0x20 до 0х7Е*/
#include "libft.h"

int	ft_isprint(int c)
{
	return (c >= 32 && c <= 126);
}

/*int main (void)
{
    char d;
    d = 'g';
    int a = ft_isascii(d);
    printf("%i", a);
    return (0);
*/
