/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isascii.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mnalyvai <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2022/10/02 17:29:52 by mnalyvai          #+#    #+#             */
/*   Updated: 2022/10/08 16:54:54 by mnalyvai         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include "libft.h"

int	ft_isascii(int c)
{
	if (c >= 0 && c <= 127)
		return (1);
	return (0);
}

/*int main (void)
{
	int d;
	d = '*';
    int c = ft_isascii(d);
    printf("%i", c);
return (0);
}*/
/* isascii возвращает ненулевое значение если младший
байт ch лежит в диапазоне от 0 до 127 */